app/Controllers/Dashboard.php

SELECT *
FROM `warehouses`
---
    public function staffScanner()
    {
        if (session('user_role') !== 'warehouse_staff') {
            return redirect()->to('/login');
        }
        $warehouseModel = new \App\Models\WarehouseModel();
        $data['warehouses'] = $warehouseModel->findAll();