app/Controllers/InventoryController.php

    public function view($id)
    {
        // Check if user is manager
        if (session('user_role') !== 'warehouse_manager') {
            return redirect()->to('/login');
        }

        // Get item with relations
        $builder = $this->inventoryModel->db->table('inventory_items i');
        $builder->select('i.*, c.category_name, w.warehouse_name');
        $builder->join('categories c', 'c.id = i.category_id');
        $builder->join('warehouses w', 'w.id = i.warehouse_id');
        $builder->where('i.id', $id);
        $item = $builder->get()->getRowArray();
---
SELECT `i`.*, `c`.`category_name`, `w`.`warehouse_name`
FROM `inventory_items` `i`
JOIN `categories` `c` ON `c`.`id` = `i`.`category_id`
JOIN `warehouses` `w` ON `w`.`id` = `i`.`warehouse_id`
WHERE `i`.`id` = '1'

    public function edit($id)
    {
        // Check if user is manager
        if (session('user_role') !== 'warehouse_manager') {
            return redirect()->to('/login');
        }

        // Get item with relations
        $builder = $this->inventoryModel->db->table('inventory_items i');
        $builder->select('i.*, c.category_name, w.warehouse_name');
        $builder->join('categories c', 'c.id = i.category_id');
        $builder->join('warehouses w', 'w.id = i.warehouse_id');
        $builder->where('i.id', $id);
        $item = $builder->get()->getRowArray();
---
SELECT `i`.*, `c`.`category_name`, `w`.`warehouse_name`, `w`.`location` as `warehouse_location`
FROM `inventory_items` `i`
LEFT JOIN `categories` `c` ON `c`.`id` = `i`.`category_id`
LEFT JOIN `warehouses` `w` ON `w`.`id` = `i`.`warehouse_id`
WHERE `i`.`id` = '7'