app/Controllers/PaymentRecordingController.php

SELECT `ap_payment_transactions`.*, `accounts_payable`.`invoice_number`, `vendors`.`vendor_name`
FROM `ap_payment_transactions`
JOIN `accounts_payable` ON `accounts_payable`.`id` = `ap_payment_transactions`.`ap_id`
JOIN `vendors` ON `vendors`.`id` = `accounts_payable`.`vendor_id`
ORDER BY `ap_payment_transactions`.`payment_date` DESC
---
    private function getPaymentsWithDetails()
    {
        return $this->paymentModel->select('ap_payment_transactions.*, accounts_payable.invoice_number, vendors.vendor_name')
                                  ->join('accounts_payable', 'accounts_payable.id = ap_payment_transactions.ap_id')
                                  ->join('vendors', 'vendors.id = accounts_payable.vendor_id')
                                  ->orderBy('ap_payment_transactions.payment_date', 'DESC')
                                  ->findAll();