app/Controllers/StockApprovalController.php

SELECT `sm`.*, `u`.`first_name`, `u`.`last_name`, `i`.`item_name`, `i`.`current_stock`
FROM `stock_movements` `sm`
LEFT JOIN `users` `u` ON `u`.`id` = `sm`.`performed_by`
JOIN `inventory_items` `i` ON `i`.`id` = `sm`.`inventory_item_id`
WHERE `sm`.`approval_status` = 'pending'
ORDER BY `sm`.`created_at` DESC
---
    public function pending()
    {
        // Check if user is authenticated
        if (!session()->has('user_id')) {
            return $this->failUnauthorized('Not authenticated');
        }

        try {
            $db = \Config\Database::connect();
            $movements = $db->table('stock_movements sm')
                           ->select('sm.*, u.first_name, u.last_name, i.item_name, i.current_stock')
                           ->join('users u', 'u.id = sm.performed_by', 'left')
                           ->join('inventory_items i', 'i.id = sm.inventory_item_id')
                           ->where('sm.approval_status', 'pending')
                           ->orderBy('sm.created_at', 'DESC')
                           ->get()
                           ->getResultArray();

SELECT *
FROM `stock_movements`
WHERE `stock_movements`.`id` = '10'
---
    public function approve($id = null)
    {
        if (!session()->has('user_id')) {
            return $this->failUnauthorized('Not authenticated');
        }

        if (!$id) {
            return $this->failValidationErrors('Movement ID is required');
        }

        try {
            // Log incoming request for debugging
            log_message('info', 'Approve request received for ID: ' . $id);
            log_message('info', 'Request body: ' . $this->request->getBody());

            $data = $this->request->getJSON(true);
            if ($data === null) {
                $data = [];
            }

            log_message('info', 'Parsed data: ' . json_encode($data));

            $movementModel = new StockMovementModel();

            // Get movement
            $movement = $movementModel->find($id);

UPDATE `stock_movements` SET `approval_status` = 'approved', `approved_by` = '1', `approval_notes` = '', `updated_at` = '2025-12-16 05:45:03'
WHERE `id` = '10'
---
                // Update approval status using query builder to avoid "no data to update" error
                $builder = $db->table('stock_movements');
                $builder->where('id', $id);
                $builder->update([
                    'approval_status' => 'approved',
                    'approved_by' => session('user_id'),
                    'approval_notes' => $data['approval_notes'] ?? null,
                    'updated_at' => date('Y-m-d H:i:s')
                ]);

UPDATE `inventory_items` SET `current_stock` = '100', `updated_at` = '2025-12-16 05:45:03'
WHERE `inventory_items`.`id` IN ('2')
---
                    }
                    // Transfer doesn't affect total stock in this warehouse model

                    $inventoryModel->update($movement['inventory_item_id'], [
                        'current_stock' => $newStock,
                        'updated_at' => date('Y-m-d H:i:s')
                    ]);