app/Controllers/TopManagementPOApprovals.php

    public function purchaseOrders()
    {
        if ($redirect = $this->requireTopManagement()) {
            return $redirect;
        }

        $db = \Config\Database::connect();

        $pos = $db->table('purchase_orders po')
            ->select('po.*, pr.pr_number, v.vendor_name, w.warehouse_name, u.first_name, u.last_name')
            ->join('purchase_requests pr', 'pr.id = po.purchase_request_id', 'left')
            ->join('vendors v', 'v.id = po.vendor_id', 'left')
            ->join('warehouses w', 'w.id = po.warehouse_id', 'left')
            ->join('users u', 'u.id = po.created_by', 'left')
            ->where('po.po_approval_status', 'pending')
            ->orderBy('po.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `po`.*, `pr`.`pr_number`, `v`.`vendor_name`, `w`.`warehouse_name`, `u`.`first_name`, `u`.`last_name`
FROM `purchase_orders` `po`
LEFT JOIN `purchase_requests` `pr` ON `pr`.`id` = `po`.`purchase_request_id`
LEFT JOIN `vendors` `v` ON `v`.`id` = `po`.`vendor_id`
LEFT JOIN `warehouses` `w` ON `w`.`id` = `po`.`warehouse_id`
LEFT JOIN `users` `u` ON `u`.`id` = `po`.`created_by`
WHERE `po`.`po_approval_status` = 'pending'
ORDER BY `po`.`created_at` DESC