app/Controllers/TopManagementDashboard.php

    private function getPendingPoCount(): int
    {
        $db = \Config\Database::connect();
        if (! $db->fieldExists('po_approval_status', 'purchase_orders')) {
            return 0;
        }

        $poModel = new PurchaseOrderModel();
        return (int) $poModel->where('po_approval_status', 'pending')->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `po_approval_status` = 'pending'
AND `purchase_orders`.`deleted_at` IS NULL

    public function index()
    {
        if ($redirect = $this->requireTopManagement()) {
            return $redirect;
        }

        $inventoryModel = new InventoryModel();
        $apModel = new AccountsPayableModel();
        $arModel = new AccountsReceivableModel();
        $prModel = new PurchaseRequestModel();
        $poModel = new PurchaseOrderModel();

        $warehouseSummary = $inventoryModel->getStockSummaryByWarehouse();
        $lowStockItems = $inventoryModel->getLowStockItems();

        $apStats = $apModel->getStatistics();
        $arOutstanding = $arModel->getTotalOutstanding();
        $arPendingCount = $arModel->whereIn('status', ['pending', 'partial', 'overdue'])->countAllResults(false);

        $pendingPrCount = $prModel->where('status', 'submitted')->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `accounts_receivable`
WHERE `status` IN ('pending','partial','overdue')
AND `accounts_receivable`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `purchase_requests`
WHERE `status` = 'submitted'
AND `purchase_requests`.`deleted_at` IS NULL

    public function financialSummary()
    {
        if ($redirect = $this->requireTopManagement()) {
            return $redirect;
        }

        $apModel = new AccountsPayableModel();
        $arModel = new AccountsReceivableModel();
        $db = \Config\Database::connect();

        $apStats = $apModel->getStatistics();
        $arOutstanding = $arModel->getTotalOutstanding();

        $arByStatus = $db->table('accounts_receivable')
            ->select('status, COUNT(*) as cnt')
            ->where('deleted_at', null)
            ->groupBy('status')
            ->get()
            ->getResultArray();
---
SELECT `status`, COUNT(*) as cnt
FROM `accounts_receivable`
WHERE `deleted_at` IS NULL
GROUP BY `status`