app/Models/AccountsReceivableModel.php

    public function getTotalOutstanding()
    {
        $result = $this->selectSum('balance')
                       ->whereIn('status', ['pending', 'partial', 'overdue'])
                       ->first();
---
SELECT SUM(`balance`) AS `balance`
FROM `accounts_receivable`
WHERE `status` IN ('pending','partial','overdue')
AND `accounts_receivable`.`deleted_at` IS NULL
 LIMIT 1