app/Models/AccountsPayableModel.php

SELECT SUM(`balance`) AS `balance`
FROM `accounts_payable`
WHERE `status` IN ('pending','partial','overdue')
---
    public function getTotalAmountDue()
    {
        $result = $this->selectSum('balance')->whereIn('status', ['pending', 'partial', 'overdue'])->get()->getRow();

SELECT SUM(`paid_amount`) AS `paid_amount`
FROM `accounts_payable`
WHERE `accounts_payable`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getStatistics()
    {
        return [
            'total_invoices' => $this->countAllResults(false),
            'total_amount' => $this->selectSum('invoice_amount')->first()['invoice_amount'] ?? 0,
            'total_paid' => $this->selectSum('paid_amount')->first()['paid_amount'] ?? 0,
            'total_outstanding' => $this->getTotalAmountDue(),
            'pending_count' => $this->where('status', 'pending')->countAllResults(false),
            'partial_count' => $this->where('status', 'partial')->countAllResults(false),
            'paid_count' => $this->where('status', 'paid')->countAllResults(false),
            'overdue_count' => $this->where('status', 'overdue')->countAllResults(false),
            'processed_today' => $this->getProcessedTodayCount()
        ];