app/Models/ApPaymentTransactionsModel.php

    public function getTotalPaymentsToday()
    {
        $result = $this->selectSum('amount')
                       ->where('DATE(payment_date)', date('Y-m-d'))
                       ->get()->getRow();
---
SELECT SUM(`amount`) AS `amount`
FROM `ap_payment_transactions`
WHERE DATE(payment_date) = '2025-12-16'

    public function getTotalPaymentsThisMonth()
    {
        $result = $this->selectSum('amount')
                       ->where('MONTH(payment_date)', date('m'))
                       ->where('YEAR(payment_date)', date('Y'))
                       ->get()->getRow();
---
SELECT SUM(`amount`) AS `amount`
FROM `ap_payment_transactions`
WHERE MONTH(payment_date) = '12'
AND YEAR(payment_date) = '2025'

    public function getPendingPaymentsCount()
    {
        $apModel = new AccountsPayableModel();
        return $apModel->whereIn('status', ['pending', 'partial'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `accounts_payable`
WHERE `status` IN ('pending','partial')
AND `accounts_payable`.`deleted_at` IS NULL