app/Models/InventoryModel.php

    public function getWarehouseStats()
    {

        $builder = $this->db->table('inventory_items i');
        $builder->select('w.warehouse_name, COUNT(i.id) as item_count, SUM(i.current_stock) as total_items, SUM(i.current_stock * i.unit_price) as total_value');
        $builder->join('warehouses w', 'w.id = i.warehouse_id');
        $builder->groupBy('w.id, w.warehouse_name');
        $results = $builder->get()->getResultArray();
---
SELECT `w`.`warehouse_name`, COUNT(i.id) as item_count, SUM(i.current_stock) as total_items, SUM(i.current_stock * i.unit_price) as total_value
FROM `inventory_items` `i`
JOIN `warehouses` `w` ON `w`.`id` = `i`.`warehouse_id`
GROUP BY `w`.`id`, `w`.`warehouse_name`

    public function getItemsWithRelations()
    {
        $builder = $this->db->table('inventory_items i');
        $builder->select('i.*, c.category_name, w.warehouse_name');
        $builder->join('categories c', 'c.id = i.category_id');
        $builder->join('warehouses w', 'w.id = i.warehouse_id');
        $builder->orderBy('i.created_at', 'DESC');
        return $builder->get()->getResultArray();
---
SELECT `i`.*, `c`.`category_name`, `w`.`warehouse_name`
FROM `inventory_items` `i`
JOIN `categories` `c` ON `c`.`id` = `i`.`category_id`
JOIN `warehouses` `w` ON `w`.`id` = `i`.`warehouse_id`
ORDER BY `i`.`created_at` DESC

    public function getStockSummaryByWarehouse()
    {
        $builder = $this->db->table('inventory_items i');
        $builder->select('
            w.id as warehouse_id,
            w.warehouse_name,
            COUNT(i.id) as total_items,
            SUM(i.current_stock) as total_quantity,
            SUM(i.current_stock * i.unit_price) as total_value,
            SUM(CASE WHEN i.current_stock <= i.minimum_stock THEN 1 ELSE 0 END) as low_stock_count
        ');
        $builder->join('warehouses w', 'w.id = i.warehouse_id');
        $builder->groupBy('w.id, w.warehouse_name');
        $builder->orderBy('w.warehouse_name', 'ASC');
        return $builder->get()->getResultArray();
---
SELECT `w`.`id` as `warehouse_id`, `w`.`warehouse_name`, COUNT(i.id) as total_items, SUM(i.current_stock) as total_quantity, SUM(i.current_stock * i.unit_price) as total_value, SUM(CASE WHEN i.current_stock <= i.minimum_stock THEN 1 ELSE 0 END) as low_stock_count
FROM `inventory_items` `i`
JOIN `warehouses` `w` ON `w`.`id` = `i`.`warehouse_id`
GROUP BY `w`.`id`, `w`.`warehouse_name`
ORDER BY `w`.`warehouse_name` ASC